# Dotfiles dependencies — install with: brew bundle
tap "ddev/ddev"

# Shell & CLI
brew "bat"
brew "direnv"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "glab"
brew "lazygit"
brew "lsd"
brew "mise"
brew "ripgrep"
brew "starship"
brew "stow"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "fastfetch"
brew "atuin"

# Dev workflow
brew "ddev/ddev/ddev"
brew "mkcert"
brew "neovim"
# shopware-cli: install via your existing method (tap/formula varies)

# Optional
# brew "just"
# brew "watchexec"

# Apps
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
# cask "amethyst"
